package FinalExam_TestVersion;

/**
 * 문제23. 학생의 이름, 나이,듣는 과목의 정보를 저장할 수 있는 Student 클래스를 정의합니다.
 *        그리고 생성자로 초기화합니다. 객체 배열의 길이는 3이며 학생의 과목 정보를 변경시킬 수 있는 메소드와
 *        학생 정보를 출력하는 메소드도 함께 정의하는 프로그램을 만들어 제출하세요.
 *
 *        클래스명 : Student
 *        [필드명]      [접근 제어자]    [정보]
 *        name         private         이름
 *        age          private         나이
 *        subject      private         과목명
 *
 *
 *        클래스명: Exam15
 *        [객체배열]    [배열 길이]    [정보]
 *        Student      3            학생의 이름, 나이, 과목 저장
 *
 *      [실행 결과]
 *       -------
 *       이름: 예지
 *       나이: 15
 *       과목:자바기본
 *       -------
 *       이름: 희원
 *       나이: 14
 *       과목:코틀린
 *       -------
 *       아름: 태이
 *       나이: 16
 *       과목:자바심화
 */

public class Exam23 {

}
